share/tutorials/heat-transfer/buoyant-simple/hot_radiation_room_fv_dom/0/epsilon
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  location    "0";
  object      epsilon;
}

dimensions      [0 2 -3 0 0 0 0];
internalField   uniform 0.01;

boundaryField
{
  box
  {
    type            epsilonWallFunction;
    Cmu             0.09;
    kappa           0.41;
    E               9.8;
    value           uniform 0.01;
  }
  floor
  {
    type            epsilonWallFunction;
    Cmu             0.09;
    kappa           0.41;
    E               9.8;
    value           uniform 0.01;
  }
  ceiling
  {
    type            epsilonWallFunction;
    Cmu             0.09;
    kappa           0.41;
    E               9.8;
    value           uniform 0.01;
  }
  fixedWalls
  {
    type            epsilonWallFunction;
    Cmu             0.09;
    kappa           0.41;
    E               9.8;
    value           uniform 0.01;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
